"""
1. написать базовый класс для средства передвижения, определить у него общие свойства. Например, вес, грузоподъемность.
Определить общие методы, например “издать звук”

2. сделать несколько наследников класса. Например: корабль, автомобиль, самолёт. Перегрузить у них методы, чтобы
соответствовать классу. Также добавить свойства, относящиеся к классу: водоизмещение, количество колёс, предельная высота и т.д.
базовые классы могут быть реализованы асбстрактными классами при помощи модуля abc

3. создать более конкретные классы. Например: “легковой автомобиль”, “парусная лодка” и тд.
Перегрузить общие свойства, а также добавить дополнительные свойства и методы

4. разнести все классы и исключения в отдельные модули

5. добавить методы, которые принимают параметры

6. добавить в инициализатор и другие методы классов выкидывание исключения при передаче неподходящих аргументов,
или не выполнении других внутренних условий (например, если бак пустой, то при попытке “завести” ТС
будет выкинуто исключение, что недостаточно топлива)
можно создать вспомогательные объекты при помощи датаклассов. Например, объект “двигатель”, у которого есть несколько свойств:
литраж, количество поршней, максимальное количество оборотов… на ваш выбор

7. сделать главный модуль, при запуске которого выполняется демонстрация работы всех классов (красивые принты приветствуются)
"""

# Constants

# Imports

#1
class Transport:
    weight = 0
    carrying = 0

    def beep(self):
        pass


# MAIN
if __name__ == "__main__":
    pass